package day02;
//变量的演示
public class VarDemo {
	public static void main(String[] args) {
		/*
		 * 变量的练习:
		 * 1.声明一个整型变量，名为a
		 *   声明三个整型变量，名为b,c,d
		 * 2.声明整型变量e并直接赋值为25
		 *   声明整型变量f，将f赋值为25
		 * 3.声明整型变量g并赋值为26.78-----???
		 *   输出h的值--------------------???
		 *   声明整型变量i，输出i的值--------???
		 * 4.声明整型变量j并赋值为5
		 *   声明整型变量k并赋值为j+10，输出k的值
		 *   在j本身基础之上增100，输出j的值
		 * 5.声明几个正确的和几个错误的变量名
		 */
		
		
		
		
		
		
		
		
		
		
		
		
		
		/*
		//4.变量的命名
		int a1,a_2,a_$5y;
		//int a*b; //编译错误，不能包含*号
		//int 1a; //编译错误，不能以数字开头
		//int class; //编译错误，不能使用关键字
		//Int a; //编译错误，严格区分大小写
		int 年龄; //正确，但不建议
		int age; //建议"见名知意"
		int score,myScore,myJavaScore; //驼峰命名法
		*/
		
		/*
		//3.变量的使用:
		//  1)变量的使用必须与数据类型匹配
		//  2)变量在使用之前必须声明并且初始化
		//  3)对变量的操作就是对那个数的操作
		//int a=25.678; //编译错误，数据类型不匹配
		
		//System.out.println(a); //编译错误，a未声明
		//int b;
		//System.out.println(b); //编译错误，b未初始化
		
		int c=5;
		int d=c+10; //取出c的值5，加10后，赋值给d
		System.out.println(d); //输出d的值15
		
		int e=10;
		e=e+100; //取出e的值10，加100后，赋值给e
		         //在本身基础之上增100
		System.out.println(e); //输出e的值110
		*/
		
		
		
		/*
		//2.变量的初始化:第一次赋值
		int a=250; //声明整型变量a并赋值为250
		int b; //声明整型变量b
		b=250; //给变量b赋值为250
		*/
		
		/*
		//1.变量的声明
		int a; //声明一个整型变量，名为a
		int b,c,d; //声明三个整型变量，名为b,c,d
		*/
	}
}
